ConfigFiles/InformationRegisters/ИспользованиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИспользованиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилоИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаИспользованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновленияПриемникаИзИсточника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеОписанияИсточника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеОписанияПриемника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/CommonForms/ИнформацияОбИспользованииОбъектаИсточника/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Приемник = Параметры.Приемник;
	Источник = Параметры.Источник;
	ПравилоИспользования = Параметры.ПравилоИспользования;
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Приемник, "Владелец");
	
	ДоступноПравоИзменения = УправлениеДоступомСППР.РольДоступнаПоПроекту("ДобавлениеИзменениеОбъектовМетаданных", Проект);
	
	Если НЕ ДоступноПравоИзменения Тогда
		ТолькоПросмотр = Истина;
	Иначе
		УстановитьДоступностьПравилаИспользования();
	КонецЕсли;
	
	Если Источник = Неопределено Тогда
		УстановитьТипИсточника(Приемник, Источник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	УстановитьДоступностьПравилаИспользования();;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОчистка(Элемент, СтандартнаяОбработка)
	
    УстановитьТипИсточника(Приемник, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОбработатьИзменениеДанных();
	Оповестить("ИзменениеИнформацииОбИспользованииИсточника", Приемник);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьПравилаИспользования()
	
	Элементы.ПравилоИспользования.Доступность = ЗначениеЗаполнено(Источник) И ДоступноПравоИзменения;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДанных()
	
	РегистрыСведений.ИспользованиеОбъектов.ЗаписатьИнформациюОбИспользованииОбъектаПриемником(Приемник,
	                                                                                          Источник,
																							  ПравилоИспользования);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТипИсточника(Приемник, Источник)
	
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(Приемник));
	
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	Значение = ОписаниеТипов.ПривестиЗначение(Неопределено);
	
	Источник = Значение;
	
КонецПроцедуры

#КонецОбласти
